#ifndef EQMAC_HPP
#define EQMAC_HPP

#include <cstdint>
#include <cstring>
#include <cmath>

#include <windows.h>

const char* EQ_STRING_WINDOW_TITLE     = "EverQuest";
const char* EQ_STRING_WINDOW_TITLE_EQW = "EQW beta 2.32";

const char* EQ_STRING_GRAPHICS_DLL_NAME = "EQGfx_Dx8.dll";

#define EQ_TIMER 0x007989D4 // DWORD ; time elapsed in milliseconds

#define EQ_IS_IN_GAME 0x00798550 // BYTE

#define EQ_IS_AUTO_ATTACK_ENABLED 0x007F6FFE // BYTE

#define EQ_IS_NET_STATUS_ENABLED 0x007985EC // BYTE

#define EQ_IS_KEY_PRESSED_SHIFT   0x0080931C // DWORD
#define EQ_IS_KEY_PRESSED_CONTROL 0x00809320 // DWORD
#define EQ_IS_KEY_PRESSED_ALT     0x0080932C // DWORD

#define EQ_IS_CAPSLOCK_ENABLED 0x00809324 // DWORD
#define EQ_IS_NUMLOCK_ENABLED  0x00809328 // DWORD

#define EQ_POINTER_GRAPHICS_DLL 0x007F9C50 // EQGfx_Dx8.DLL base address

#define EQ_GRAPHICS_DLL_DEFERRED_OBJECTS_MAX 4000 // t3dDeferLine, etc

#define EQ_POINTER_StringTable 0x007F9490 // eqstr_xx.txt

#define EQ_POINTER_SPELL_MANAGER 0x805CB0

#define EQ_POINTER_FONT_ARIAL14 0x0063D3B0

#define EQ_POINTER_CEverQuest 0x00809478
#define EQ_OFFSET_CEverQuest_GAME_STATE 0x5AC // DWORD

#define EQ_GAME_STATE_CHARACTER_SELECT 1
#define EQ_GAME_STATE_INGAME           5

#define EQ_POINTER_CDisplay 0x007F9510
#define EQ_OFFSET_CDisplay_IS_CURSOR_ITEM   0x040 // BYTE ; when you pick up and hold an item on your mouse cursor

    "ERU",
    "ELF",
    "HIE",
    "DEF",
    "HEF",
    "DWF",
    "TRL",
    "OGR",
    "HFL",
    "GNM",
    // IKS
    // VAH
    // FRG
};

size_t EQ_STRINGSIZE_CLASS_NAME = 33;

const char* EQ_STRING_CLASS_NAME[33] =
{
    "Unknown",
    "Warrior",
    "Cleric",
    "Paladin",
    "Ranger",
    "Shadow Knight",
    "Druid",
    "Monk",
    "Bard",
    "Rogue",
    "Shaman",
    "Necromancer",
    "Wizard",
    "Magician",
    "Enchanter",
    "Beastlord",
    "Banker",
    "Warrior GM",
    "Cleric GM",
    "Paladin GM",
    "Ranger GM",
    "Shadow Knight GM",
    "Druid GM",
    "Monk GM",
    "Bard GM",
    "Rogue GM",
    "Shaman GM",
    "Necromancer GM",
    "Wizard GM",
    "Magician GM",
    "Enchanter GM",
    "Beastlord GM",
    "Merchant",
};

size_t EQ_STRINGSIZE_CLASS_SHORT_NAME = 33;

const char* EQ_STRING_CLASS_SHORT_NAME[33] =
{
    "UNK",
    "WAR",
    "CLR",
    "PAL",
    "RNG",
    "SHD",
    "DRU",
    "MNK",
    "BRD",
    "ROG",
    "SHM",
    "NEC",
    "WIZ",
    "MAG",
    "ENC",
    "BST",
    "BANKER",
    "WAR",
    "CLR",
    "PAL",
    "RNG",
    "SHD",
    "DRU",
    "MNK",
    "BRD",
    "ROG",
    "SHM",
    "NEC",
    "WIZ",
    "MAG",
    "ENC",
    "BST",
    "MERCHANT",
};

size_t EQ_KEYVALUESTRINGLISTSIZE_DOOR_SPAWN_NAME_DESCRIPTION = 22;

const char* EQ_KEYVALUESTRINGLIST_DOOR_SPAWN_NAME_DESCRIPTION[][2] =
{
    {"POKTELE500",    "Plane of Knowledge Portal"}, // POK Book

    {"POKAAPORT500",  "Ak'Anon Portal"},
    {"POKCABPORT500", "Cabilis Portal"},
    {"POKERPORT500",  "Erudin Portal"},
    {"POKFELPORT500", "Felwithe Portal"},
    {"POKFVPORT500",  "Firiona Vie Portal"},
    {"POKFPTPORT500", "Freeport Portal"},
    {"POKGROPORT500", "Grobb Portal"},
    {"POKHALPORT500", "Halas Portal"},
    {"POKKALPORT500", "Kaladim Portal"},
    {"POKKELPORT500", "Kelethin Portal"},
    {"POKNRKPORT500", "Neriak Portal"},
    {"POKOGPORT500",  "Oggok Portal"},
    {"POKOVPORT500",  "Overthere Portal"},
    {"POKPPORT500",   "Paineel Portal"},
    {"POKPTPORT500",  "Plane of Tranquility Portal"},
    {"POKQNSPORT500", "Qeynos Portal"},
    {"POKRVPORT500",  "Rivervale Portal"},
    {"POKSHPORT500",  "Shar Vahl Portal"},
    {"POKTGDPORT500", "The Great Divide Portal"},
    {"POKTNPORT500",  "The Nexus Portal"},

    {"FAYLEVATOR",    "Faydark Elevator"},
};

size_t EQ_KEYVALUESTRINGLISTSIZE_GROUND_SPAWN_NAME_DESCRIPTION = 11;

const char* EQ_KEYVALUESTRINGLIST_GROUND_SPAWN_NAME_DESCRIPTION[][2] =
{
    {"IT27_ACTORDEF",    "Book"},
    {"IT28_ACTORDEF",    "Book"},
    {"IT63_ACTORDEF",    "Small Bag"},
    {"IT64_ACTORDEF",    "Large Bag"},
    {"IT66_ACTORDEF",    "Forge"},
    {"IT69_ACTORDEF",    "Oven"},
    {"IT70_ACTORDEF",    "Brew Barrel"},
    {"IT73_ACTORDEF",    "Kiln"},
    {"IT74_ACTORDEF",    "Pottery Wheel"},
    {"IT128_ACTORDEF",   "Sewing Kit"},
    {"IT10645_ACTORDEF", "Book"},
};

/****************************************************************************************************/

typedef struct _EQLOCATION
{
    FLOAT Y;
    FLOAT X;
    FLOAT Z;
} EQLOCATION, *PEQLOCATION;

typedef struct _EQLINE
{
    FLOAT X1;
    FLOAT Y1;
    FLOAT Z1 = 1.0f;
    FLOAT X2;
    FLOAT Y2;
    FLOAT Z2 = 1.0f;
} EQLINE, *PEQLINE;

typedef struct _EQMAPLINE
{
    struct _EQMAPLINE* Next;
    FLOAT X1;
    FLOAT Y1;
    FLOAT Z1;
    FLOAT X2;
    FLOAT Y2;
    FLOAT Z2;
    union
    {
        struct
        {
            BYTE B;
            BYTE G;
            BYTE R;
            BYTE RESERVED;
        };
        DWORD RGB;
    };
    BYTE Layer;
} EQMAPLINE, *PEQMAPLINE;

typedef struct _EQMAPPOINT
{
    struct _EQMAPPOINT* Next;
    FLOAT X;
    FLOAT Y;
    FLOAT Z;
    union
    {
        struct
        {
            BYTE B;
            BYTE G;
            BYTE R;
            BYTE RESERVED;
        };
        DWORD RGB;
    };
    DWORD Size;
    CHAR Text[128];
    BYTE Layer;
} EQMAPPOINT, *PEQMAPPOINT;

typedef struct _EQARGBCOLOR
{
    union
    {
        struct
        {
            BYTE B;
            BYTE G;
            BYTE R;
            BYTE A;
        };
        DWORD ARGB;
    };
} EQARGBCOLOR, *PEQARGBCOLOR;

typedef struct _EQZONEINFO
{
/* 0x0000 */ CHAR PlayerName[64]; // [0x40]
/* 0x0040 */ CHAR ShortName[32]; // [0x20]
/* 0x0060 */ CHAR LongName[128]; // [0x80]
/* ...... */ // TODO
} EQZONEINFO, *PEQZONEINFO;

// sizeof EQBUFFINFO 0x0A
typedef struct _EQBUFFINFO
{
/* 0x0000 */ BYTE Unknown0000;
/* 0x0001 */ BYTE CasterLevel; // level of player who casted the buff
/* 0x0002 */ BYTE Modifier; // divide by 10 to get Bard song modifier
/* 0x0003 */ BYTE Unknown0003;
/* 0x0004 */ WORD SpellId;
/* 0x0006 */ WORD Ticks; //  duration in ticks ; seconds = ticks * 3
/* 0x0008 */ WORD Unknown0008;
} EQBUFFINFO, *PEQBUFFINFO;

typedef struct _EQSPELLINFO
{
    DWORD Id;
    FLOAT Range;
    FLOAT AeRange;
    FLOAT PushBack;
    FLOAT PushUp;
    DWORD CastTime;
    DWORD RecoveryTime;
    DWORD RecastTime;
    DWORD DurationType;
    DWORD DurationValue1;
    DWORD DurationValue2;
    WORD Mana;
    short Base[12];
    short Max[12];
    WORD BookIcon;
    WORD GemIcon;
    short ReagentID[4];
    short ReagentCount[4];
    BYTE Unknown0146[8];
    BYTE Calc[12];
    BYTE Unknown0158[4];
    BYTE Attribute[12];
    BYTE TargetType;
    BYTE FizzleAdjust;
    BYTE Skill;
    BYTE Location;
    BYTE Unknown0174[3];
    BYTE Level[15];
    BYTE Unknown0192[36];
    PCHAR Name; // [32];
    PCHAR Target; //[16];
    PCHAR Extra; //[32];
    PCHAR Unknown0204; //[40];
    PCHAR Unknown0208; //[40];
    PCHAR CastOnYou; //[32];
    PCHAR CastOnOther; //[40];
    PCHAR WearOff; //[32];
/* ...... */ // TODO
} EQSPELLINFO, *PEQSPELLINFO;

typedef struct _EQSPELLLIST
{
    //BYTE Unknown0000[4];
    struct _EQSPELLINFO* Spell[4096];
} EQSPELLLIST, *PEQSPELLLIST;

// class EQ_Character
typedef struct _EQCHARINFO
{
/* 0x0000 */ BYTE Unknown0000[2];
/* 0x0002 */ CHAR Name[64]; // [0x40]
/* 0x0042 */ CHAR LastName[70]; // [0x46] ; surname or title
/* 0x0088 */ WORD Gender; // EQ_GENDER_x
/* 0x008A */ WORD Race; // EQ_RACE_x
/* 0x008C */ WORD Class; // EQ_CLASS_x
/* 0x008E */ WORD Unknown008E;
/* 0x0090 */ WORD Level;
/* 0x0092 */ WORD Unknown0092;
/* 0x0094 */ DWORD Experience; // EXP
/* 0x0098 */ WORD Face;
/* 0x009A */ WORD Mana;
/* 0x009C */ WORD BaseHP;
/* 0x009E */ WORD StunnedState; // EQ_STUNNED_STATE_x
/* 0x00A0 */ WORD BaseSTR;
/* 0x00A2 */ WORD BaseSTA;
/* 0x00A4 */ WORD BaseCHA;
/* 0x00A6 */ WORD BaseDEX;
/* 0x00A8 */ WORD BaseINT;
/* 0x00AA */ WORD BaseAGI;
/* 0x00AC */ WORD BaseWIS;
/* 0x00AE */ BYTE Unknown00AE[438];
/* 0x0264 */ EQBUFFINFO Buffs[15];
/* 0x02FA */ BYTE Unknown02FA[1080];
/* 0x0732 */ WORD SpellBook[250];
/* 0x0926 */ BYTE Unknown0926[524];
/* 0x0B32 */ WORD MemorizedSpells[8];
/* 0x0B42 */ BYTE Unknown0B42[34];
/* 0x0B64 */ BYTE StandingState; // EQ_STANDING_STATE_x
/* 0x0B65 */ BYTE Unknown0B65[3];
/* 0x0B68 */ DWORD Platinum;
/* 0x0B6C */ DWORD Gold;
/* 0x0B70 */ DWORD Silver;
/* 0x0B74 */ DWORD Copper;
/* 0x0B78 */ DWORD BankPlatinum;
/* 0x0B7C */ DWORD BankGold;
/* 0x0B80 */ DWORD BankSilver;
/* 0x0B84 */ DWORD BankCopper;
/* 0x0B88 */ BYTE Unknown0B88[32];
/* 0x0BA8 */ WORD Skills[74];
/* ...... */ // TODO
} EQCHARINFO, *PEQCHARINFO;

typedef struct _EQACTORINFO
{
/* ...... */ // TODO
} EQACTORINFO, *PEQACTORINFO;

// sizeof EQSPAWNINFO 0x168
typedef struct _EQSPAWNINFO
{
/* 0x0000 */ BYTE Unknown0000; // always equals 0x03
/* 0x0001 */ CHAR Name[30]; // [0x1E]
/* 0x001F */ BYTE Unknown001F[37];
/* 0x0044 */ DWORD ZoneId; // EQ_ZONE_ID_x
/* 0x0048 */ FLOAT Y;
/* 0x004C */ FLOAT X;
/* 0x0050 */ FLOAT Z;
/* 0x0054 */ FLOAT Heading; // camera view left/right, yaw
/* 0x0058 */ FLOAT Unknown0058;
/* 0x005C */ FLOAT MovementSpeed;
/* 0x0060 */ FLOAT MovementSpeedY;
/* 0x0064 */ FLOAT MovementSpeedX;
/* 0x0068 */ FLOAT MovementSpeedZ;
/* 0x006C */ FLOAT MovementSpeedHeading;
/* 0x0070 */ FLOAT Unknown0070;
/* 0x0074 */ FLOAT Pitch; // camera view up/down
/* 0x0078 */ struct _EQSPAWNINFO* Prev;
/* 0x007C */ struct _EQSPAWNINFO* Next;
/* 0x0080 */ PVOID Unknown0080;
/* 0x0084 */ PEQACTORINFO ActorInfo; // EQACTORINFO
/* 0x0088 */ PEQCHARINFO CharInfo; // EQCHARINFO
/* 0x008C */ FLOAT CameraHeightOffset;
/* 0x0090 */ FLOAT ModelHeightOffset;
/* 0x0094 */ WORD SpawnId;
/* 0x0096 */ WORD PetOwnerSpawnId; // spawn id of the owner of this pet spawn
/* 0x0098 */ DWORD HpMax;
/* 0x009C */ DWORD HpCurrent;
/* 0x00A0 */ WORD GuildId;
/* 0x00A2 */ BYTE Unknown00A2[6];
/* 0x00A8 */ BYTE Type; // EQ_SPAWN_TYPE_x
/* 0x00A9 */ BYTE Class; // EQ_CLASS_x
/* 0x00AA */ WORD Race;  // EQ_RACE_x
/* 0x00AC */ BYTE Gender; // EQ_GENDER_x
/* 0x00AD */ BYTE Level;
/* 0x00AE */ BYTE IsHidden; // 0 = Visible, 1 = Invisible
/* 0x00AF */ BYTE IsSnared; // 0 = Normal Movement Speed, 1 = Slow Movement Speed
/* 0x00B0 */ BYTE IsPlayerKill; // PVP flagged with red name by Priest of Discord
/* 0x00B1 */ BYTE StandingState; // EQ_STANDING_STATE_x
/* 0x00B2 */ BYTE LightType; // EQ_LIGHT_TYPE_x
/* 0x00B3 */ BYTE Unknown00B3;
/* 0x00B4 */ WORD EquipmentMaterialType[7]; // EQ_EQUIPMENT_MATERIAL_TYPE_x ; Head,Chest,Arms,Wrist,Hands,Legs,Feet
/* 0x00C2 */ WORD EquipmentPrimaryItemType; // EQ_EQUIPMENT_ITEM_TYPE_x ; Primary
/* 0x00C4 */ WORD EquipmentSecondaryItemType; // EQ_EQUIPMENT_ITEM_TYPE_x ; Secondary
/* 0x00C6 */ WORD Unknown00C6;
/* 0x00C8 */ BYTE Unknown00C8[36];
/* 0x00EC */ BYTE Unknown00EC;
/* 0x00F0 */ FLOAT Height; // model height or size/scale (shrink, grow, etc)
/* 0x00F4 */ FLOAT Unknown00F4;
/* 0x00F8 */ FLOAT Unknown00F8;
/* 0x00FC */ FLOAT Unknown00FC;
/* 0x0100 */ FLOAT MovementBackwardSpeedMultiplier; // modifies how fast you move backwards (Default = 0.4600000083)
/* 0x0104 */ FLOAT MovementForwardSpeedMultiplier; // modifies how fast you move forwards (Default = 0.6999999881)
/* 0x0108 */ BYTE IsLinkDead; // LD
/* 0x0109 */ BYTE IsGameMaster; // GM
/* 0x010A */ WORD LevitationState; // EQ_LEVITATION_STATE_x
/* 0x010C */ DWORD TargetType; // EQ_SPAWN_TARGET_TYPE_x
/* 0x0110 */ DWORD Unknown0110;
/* 0x0114 */ DWORD AnonymousState; // EQ_ANONYMOUS_STATE_x, /anonymous and /roleplay
/* 0x0118 */ DWORD Unknown0118;
/* 0x011C */ DWORD IsAwayFromKeyboard; // AFK
/* 0x0120 */ BYTE Unknown0120[12];
/* 0x012C */ CHAR LastName[22]; // surname or title
/* 0x0142 */ BYTE Unknown0142[10];
/* 0x014C */ WORD GuildRank;
/* 0x014E */ WORD Deity; // EQ_DEITY_x
/* 0x0150 */ BYTE Unknown0150;
/* 0x0151 */ BYTE Unknown0151[6];
/* 0x0157 */ BYTE Unknown0157[5];
/* 0x015C */ DWORD Unknown015C;
/* 0x0160 */ DWORD Unknown0160;
/* 0x0164 */ DWORD Unknown0164;
} EQSPAWNINFO, *PEQSPAWNINFO;

typedef struct _EQGROUNDSPAWNINFO
{
/* 0x0000 */ struct _EQGROUNDSPAWNINFO* Prev;
/* 0x0004 */ struct _EQGROUNDSPAWNINFO* Next;
/* 0x0008 */ WORD Id;
/* 0x000A */ BYTE Unknown000A[2];
/* 0x000C */ WORD DropId;
/* 0x000E */ BYTE Unknown000E[2];
/* 0x0010 */ WORD Unknown0010;
/* 0x0012 */ BYTE Unknown0012[2];
/* 0x0014 */ DWORD Unknown0014; // pointer
/* 0x0018 */ BYTE Unknown0018[116];
/* 0x008C */ FLOAT Heading;
/* 0x0090 */ FLOAT Z;
/* 0x0094 */ FLOAT X;
/* 0x0098 */ FLOAT Y;
/* 0x009C */ CHAR Name[30];
/* ...... */ // TODO
} EQGROUNDSPAWNINFO, *PEQGROUNDSPAWNINFO;

typedef struct _EQDOORSPAWNINFO
{
/* 0x0000 */ BYTE Unknown0000[4];
/* 0x0004 */ struct _EQDOORSPAWNINFO* Prev;
/* 0x0008 */ struct _EQDOORSPAWNINFO* Next;
/* 0x000C */ BYTE Unknown000C;
/* 0x000D */ CHAR Name[11];
/* 0x0018 */ DWORD Unknown0018;
/* 0x001C */ BYTE Unknown001C[4];
/* 0x0020 */ FLOAT DefaultY;
/* 0x0024 */ FLOAT DefaultX;
/* 0x0028 */ FLOAT DefaultZ;
/* 0x002C */ FLOAT DefaultHeading;
/* 0x0030 */ FLOAT Angle;
/* 0x0034 */ FLOAT Y;
/* 0x0038 */ FLOAT X;
/* 0x003C */ FLOAT Z;
/* 0x0040 */ FLOAT Heading;
/* ...... */ // TODO
} EQDOORSPAWNINFO, *PEQDOORSPAWNINFO;

typedef struct _EQGROUPLIST
{
    struct _EQSPAWNINFO* GroupMember[5];
} EQGROUPLIST, *PEQGROUPLIST;

// sizeof EQGUILDINFO 0x96
typedef struct _EQGUILDINFO
{
/* 0x0000 */ CHAR Name[32];
/* 0x0032 */ BYTE Unknown0032[64];
} EQGUILDINFO, *PEQGUILDINFO;

typedef struct _EQGUILDLIST
{
    EQGUILDINFO Guild[512];
} EQGUILDLIST, *PEQGUILDLIST;

/****************************************************************************************************/

void EQ_ToggleBool(bool &b)
{
    b = !b;
}

float EQ_CalculateDistance(float x1, float y1, float x2, float y2)
{
    return std::sqrt(std::pow(x2 - x1, 2) + std::pow(y2 - y1, 2));
}

const char* EQ_KEYVALUESTRINGLIST_GetValueByKey(const char* list[][2], size_t listSize, char key[])
{
    for (size_t i = 0; i < listSize; i++)
    {
        if (std::strcmp(list[i][0], key) == 0)
        {
            return list[i][1]; // return Value if Key is found
        }
    }

    return NULL;
}

int EQ_GetTextColorIdByName(const char* name)
{
    for (size_t i = 0; i < EQ_STRINGSIZE_TEXT_COLOR_NAME; i++)
    {
        if (std::strcmp(EQ_STRING_TEXT_COLOR_NAME[i], name) == 0)
        {
            return i;
        }
    }

